import { d as createVNode, F as Fragment, _ as __astro_tag_component__ } from './astro/server_mvkG5t2W.mjs';

const frontmatter = {
  "title": "البنية التحتية والتقنيات الأساسية للإنترنت",
  "slug": "internet-infrastructure",
  "pubDate": "2025-04-23T00:00:00.000Z",
  "description": "مقال تقني يشرح بشكل مبسط كيفية عمل الإنترنت من الناحية التقنية والتاريخية",
  "categories": ["الشبكات والتكنولوجيا"],
  "tags": ["الإنترنت", "الشبكات"],
  "author": "Nasser Hussein",
  "arabicDate": "٢٥ شوال ١٤٤٦ هـ",
  "draft": false
};
function getHeadings() {
  return [{
    "depth": 3,
    "slug": "أصول-الإنترنت-وتطوره",
    "text": "أصول الإنترنت وتطوره"
  }, {
    "depth": 3,
    "slug": "البنية-التحتية-والتقنيات-الأساسية-للإنترنت",
    "text": "البنية التحتية والتقنيات الأساسية للإنترنت"
  }, {
    "depth": 3,
    "slug": "مجموعة-بروتوكولات-الإنترنت",
    "text": "مجموعة بروتوكولات الإنترنت"
  }, {
    "depth": 3,
    "slug": "عناوين-ip",
    "text": "عناوين IP"
  }, {
    "depth": 3,
    "slug": "الشبكات-الفرعية",
    "text": "الشبكات الفرعية"
  }, {
    "depth": 3,
    "slug": "التوجيه",
    "text": "التوجيه"
  }, {
    "depth": 3,
    "slug": "ietf",
    "text": "IETF"
  }, {
    "depth": 3,
    "slug": "التطبيقات-والخدمات",
    "text": "التطبيقات والخدمات"
  }, {
    "depth": 3,
    "slug": "الشبكات-الاجتماعية-والترفيه",
    "text": "الشبكات الاجتماعية والترفيه"
  }];
}
function _createMdxContent(props) {
  const _components = {
    h3: "h3",
    li: "li",
    p: "p",
    strong: "strong",
    ul: "ul",
    ...props.components
  };
  return createVNode(Fragment, {
    children: [createVNode(_components.p, {
      children: "الإنترنت هو البنية التحتية العالمية التي تربط بين الشبكات الحاسوبية عبر مجموعة من البروتوكولات تُعرف بـ TCP/IP. إنه يشمل مجموعة متنوعة من الشبكات، سواء كانت خاصة، عامة، أكاديمية، تجارية، أو حكومية، ويمتد من النطاق المحلي إلى العالمي. يعتمد الإنترنت على تقنيات الشبكات الإلكترونية واللاسلكية والبصرية لتبادل البيانات."
    }), "\n", createVNode(_components.h3, {
      id: "أصول-الإنترنت-وتطوره",
      children: "أصول الإنترنت وتطوره"
    }), "\n", createVNode(_components.p, {
      children: "تعود أصول الإنترنت إلى أبحاث في الستينيات التي مكّنت من مشاركة وقت استخدام الموارد الحاسوبية وتطوير تحويل الحزم، مما أدى إلى تصميم شبكات حاسوبية لتبادل البيانات. نشأت مجموعة القواعد (البروتوكولات) التي تسمح بالتشبيك على الإنترنت من خلال أبحاث وتطوير بتكليف من وكالة مشاريع الأبحاث الدفاعية المتقدمة (DARPA) التابعة لوزارة الدفاع الأمريكية في السبعينيات، بالتعاون مع جامعات وباحثين في الولايات المتحدة والمملكة المتحدة وفرنسا. خدمت شبكة ARPANET في البداية كعصب مركزي لربط الشبكات الأكاديمية والعسكرية الإقليمية في الولايات المتحدة لتمكين مشاركة الموارد. أدى تمويل شبكة مؤسسة العلوم الوطنية (NSF) في الثمانينيات، بالإضافة إلى التمويلات الخاصة لتوسعات تجارية أخرى، إلى تشجيع المشاركة العالمية في تطوير تقنيات شبكات جديدة ودمج العديد من الشبكات باستخدام مجموعة بروتوكولات DARPA."
    }), "\n", createVNode(_components.p, {
      children: "أدى ربط الشبكات التجارية والشركات في أوائل التسعينيات، إلى جانب ظهور شبكة الويب العالمية، إلى بداية التحول إلى الإنترنت الحديث، مما أدى إلى نمو هائل حيث تم ربط أجيال من الحواسيب المؤسسية والشخصية والمحمولة بالشبكة. وعلى الرغم من أن الإنترنت كان مستخدمًا بشكل واسع في الأوساط الأكاديمية في الثمانينيات، إلا أن تجاريته اللاحقة في التسعينيات وما بعدها دمجت خدماته وتقنياته في كل جوانب الحياة الحديثة تقريبًا."
    }), "\n", createVNode(_components.p, {
      children: "لا توجد إدارة مركزية واحدة للإنترنت سواء من حيث التنفيذ التكنولوجي أو السياسات الخاصة بالوصول والاستخدام؛ حيث تقوم كل شبكة بتحديد سياساتها الخاصة. يتم توجيه التعريفات العامة لمساحات الأسماء الرئيسية في الإنترنت، مثل مساحة عناوين بروتوكول الإنترنت (IP) ونظام أسماء النطاقات (DNS)، من قبل منظمة مشرفة تُعرف باسم مؤسسة الإنترنت للأسماء والأرقام المخصصة (ICANN). ويقوم فريق هندسة الإنترنت (IETF)، وهو منظمة غير ربحية تتكون من مشاركين دوليين غير رسميين، بوضع المعايير التقنية والبنية التحتية للإنترنت."
    }), "\n", createVNode(_components.h3, {
      id: "البنية-التحتية-والتقنيات-الأساسية-للإنترنت",
      children: "البنية التحتية والتقنيات الأساسية للإنترنت"
    }), "\n", createVNode(_components.p, {
      children: "الإنترنت يعتمد على مجموعة من البروتوكولات التقنية، تعرف بـ TCP/IP، والتي تنظم الاتصال عبر الطبقات المختلفة:"
    }), "\n", createVNode(_components.ul, {
      children: ["\n", createVNode(_components.li, {
        children: [createVNode(_components.strong, {
          children: "طبقة التطبيقات"
        }), ": تتعامل مع التفاعلات بين التطبيقات والخوادم، مثل بروتوكول HTTP وHTML لتبادل البيانات عبر الويب."]
      }), "\n", createVNode(_components.li, {
        children: [createVNode(_components.strong, {
          children: "طبقة النقل"
        }), ": توفر خدمات موثوقة وغير موثوقة، مثل TCP (التسليم المرتب) وUDP (البيانات غير الموثوقة)."]
      }), "\n", createVNode(_components.li, {
        children: [createVNode(_components.strong, {
          children: "طبقة الإنترنت"
        }), ": تستخدم بروتوكول IP لتوجيه حركة البيانات عبر الشبكات المتنوعة."]
      }), "\n", createVNode(_components.li, {
        children: [createVNode(_components.strong, {
          children: "طبقة الربط"
        }), ": تربط العقد على الشبكة الفيزيائية، مثل Wi-Fi وEthernet."]
      }), "\n"]
    }), "\n", createVNode(_components.h3, {
      id: "مجموعة-بروتوكولات-الإنترنت",
      children: "مجموعة بروتوكولات الإنترنت"
    }), "\n", createVNode(_components.p, {
      children: "توصف معايير الإنترنت إطارًا يعرف باسم مجموعة بروتوكولات الإنترنت (وتسمى أيضًا TCP/IP، استنادًا إلى أول مكونين فيها). هذه المجموعة هي مجموعة من البروتوكولات التي تنظم في مجموعة من الطبقات المفاهيمية حسب نطاق عملها، تم توثيقها أصلاً في RFC 1122 وRFC 1123. في القمة توجد طبقة التطبيقات، حيث يتم وصف الاتصالات من حيث الكائنات أو الهياكل البيانية الأكثر ملاءمة لكل تطبيق. على سبيل المثال، يعمل متصفح الويب في نموذج تطبيق العميل-الخادم ويتبادل المعلومات باستخدام بروتوكول نقل النص التشعبي (HTTP) وبنية بيانات متعلقة بالتطبيق مثل لغة توصيف النص التشعبي (HTML)."
    }), "\n", createVNode(_components.p, {
      children: "أسفل هذه الطبقة العليا، تربط طبقة النقل التطبيقات على مضيفات مختلفة من خلال قناة منطقية عبر الشبكة. تقدم هذه الخدمة مع مجموعة متنوعة من الخصائص الممكنة، مثل التسليم المرتب والموثوق (TCP)، وخدمة البيانات غير الموثوقة (UDP)."
    }), "\n", createVNode(_components.p, {
      children: "تحت هذه الطبقات توجد التقنيات الشبكية التي تربط الشبكات عند حدودها وتبادل الحركة بينها. تنفذ طبقة الإنترنت بروتوكول الإنترنت (IP) الذي يمكن الحواسيب من التعرف على بعضها البعض وتحديد موقعها باستخدام عناوين IP وتوجيه حركتها عبر الشبكات الوسيطة (شبكات العبور). كود طبقة بروتوكول الإنترنت مستقل عن نوع الشبكة التي يعمل عليها فعليًا."
    }), "\n", createVNode(_components.p, {
      children: "في الجزء السفلي من الهيكل توجد طبقة الربط، التي تربط العقد على نفس الوصلة الفيزيائية، وتحتوي على بروتوكولات لا تتطلب الموجهات للعبور إلى وصلات أخرى. لا تحدد مجموعة البروتوكولات صراحةً طرق نقل البتات عبر العتاد، أو البروتوكولات لإدارة مثل هذا العتاد، ولكنها تفترض أن التقنية المناسبة متوفرة. تشمل الأمثلة على تلك التقنية Wi-Fi، Ethernet، وDSL."
    }), "\n", createVNode(_components.h3, {
      id: "عناوين-ip",
      children: "عناوين IP"
    }), "\n", createVNode(_components.p, {
      children: "من أجل تحديد مواقع الحواسيب الفردية على الشبكة، يقدم الإنترنت عناوين IP. يتم استخدام عناوين IP من قبل البنية التحتية للإنترنت لتوجيه حزم الإنترنت إلى وجهاتها. تتكون من أرقام ثابتة الطول، التي توجد داخل الحزمة. عادةً ما تُخصص عناوين IP إلى المعدات إما تلقائيًا عبر DHCP، أو تُكوّن يدويًا."
    }), "\n", createVNode(_components.ul, {
      children: ["\n", createVNode(_components.li, {
        children: ["\n", createVNode(_components.p, {
          children: [createVNode(_components.strong, {
            children: "IPv4"
          }), ": بروتوكول الإنترنت الإصدار 4 (IPv4) يعرف عنوان IP كرقم 32 بت. IPv4 هو الإصدار الأول المستخدم في الجيل الأول من الإنترنت ولا يزال قيد الاستخدام الواسع. تم تصميمه ليعالج حتى 4.3 مليار مضيف تقريبًا. ومع ذلك، أدى النمو الهائل للإنترنت إلى نفاد عناوين IPv4، ودخلت هذه المرحلة النهائية في عام 2011، عندما نفد تجمع تخصيص عناوين IPv4 العالمي."]
        }), "\n"]
      }), "\n", createVNode(_components.li, {
        children: ["\n", createVNode(_components.p, {
          children: [createVNode(_components.strong, {
            children: "IPv6"
          }), ": بسبب النمو المتزايد للإنترنت واستنفاد عناوين IPv4 المتاحة، تم تطوير إصدار جديد من بروتوكول الإنترنت، وهو IPv6، في منتصف التسعينيات، والذي يوفر إمكانيات كبيرة للعناوين وفعالية أكبر في توجيه حركة الإنترنت. يستخدم IPv6 128 بت لعنوان IP وتمت معاييرته في عام 1998. يتم نشر IPv6 منذ منتصف العقد الأول من القرن الحالي ويتزايد حاليًا حول العالم."]
        }), "\n"]
      }), "\n"]
    }), "\n", createVNode(_components.h3, {
      id: "الشبكات-الفرعية",
      children: "الشبكات الفرعية"
    }), "\n", createVNode(_components.p, {
      children: "الشبكة الفرعية أو الـsubnet هي تقسيم منطقي لشبكة IP. تُعرف الممارسة المتمثلة في تقسيم شبكة إلى شبكتين أو أكثر بالتقسيم الشبكي. تتلقى الحواسيب التي تنتمي إلى شبكة فرعية عناوين IP متطابقة في الجزء الأكثر أهمية من عنوانها، مما يؤدي إلى تقسيم منطقي لعنوان IP إلى حقلين: رقم الشبكة أو بادئة التوجيه، والحقل المتبقي أو معرف المضيف."
    }), "\n", createVNode(_components.h3, {
      id: "التوجيه",
      children: "التوجيه"
    }), "\n", createVNode(_components.p, {
      children: "يستخدم الحواسيب والموجهات جداول التوجيه في نظام التشغيل لتوجيه حزم IP للوصول إلى عقدة في شبكة فرعية مختلفة. يتم الحفاظ على جداول التوجيه عن طريق التكوين اليدوي أو تلقائيًا بواسطة بروتوكولات التوجيه."
    }), "\n", createVNode(_components.h3, {
      id: "ietf",
      children: "IETF"
    }), "\n", createVNode(_components.p, {
      children: "في حين أن المكونات المادية في بنية الإنترنت يمكن استخدامها غالبًا لدعم أنظمة برمجية أخرى، إلا أن تصميم وتوحيد عملية البرمجيات هو الذي يميز الإنترنت ويوفر الأساس لقابليته للتوسع والنجاح. تتحمل قوة مهام هندسة الإنترنت (IETF) مسؤولية تصميم بنية أنظمة البرمجيات للإنترنت."
    }), "\n", createVNode(_components.h3, {
      id: "التطبيقات-والخدمات",
      children: "التطبيقات والخدمات"
    }), "\n", createVNode(_components.p, {
      children: "يحمل الإنترنت العديد من التطبيقات والخدمات، أبرزها شبكة الويب العالمية، بما في ذلك وسائل التواصل الاجتماعي، البريد الإلكتروني، التطبيقات المحمولة، الألعاب عبر الإنترنت، الهاتف عبر الإنترنت، مشاركة الملفات، وخدمات بث الوسائط. يتم استضافة معظم الخوادم التي توفر هذه الخدمات اليوم في مراكز البيانات، وغالبًا ما يتم الوصول إلى المحتوى عبر شبكات توصيل المحتوى عالية الأداء."
    }), "\n", createVNode(_components.h3, {
      id: "الشبكات-الاجتماعية-والترفيه",
      children: "الشبكات الاجتماعية والترفيه"
    }), "\n", createVNode(_components.p, {
      children: "يستخدم العديد من الأشخاص الشبكة العالمية للوصول إلى الأخبار والتقارير المتعلقة بالطقس والرياضة، لتخطيط وحجز الإجازات، ولمتابعة اهتماماتهم الشخصية. يستخدم الناس الدردشة، الرسائل، والبريد الإلكتروني للتواصل والبقاء على اتصال مع الأصدقاء حول العالم، وفي بعض الأحيان بنفس الطريقة التي كان يستخدمها البعض من قبل مع أصدقاء المراسلة. وقد أنشأت خدمات الشبكات الاجتماعية مثل فيسبوك طرقًا جديدة للتواصل الاجتماعي والتفاعل. يمكن لمستخدمي هذه المواقع إضافة مجموعة متنوعة من المعلومات إلى الصفحات، متابعة الاهتمامات المشتركة، والتواصل مع الآخرين. من الممكن أيضًا العثور على المعارف الحالية، مما يسمح بالتواصل بين مجموعات الأشخاص الموجودة بالفعل. مواقع مثل لينكدإن تدعم الاتصالات التجارية والتجارية. يوتيوب وفليكر يتخصصان في مقاطع الفيديو والصور الفوتوغرافية، وقد تحولت بعض المواقع إلى تطبيقات وتطبيقات موسيقية لعرض النصوص الموسيقية."
    })]
  });
}
function MDXContent(props = {}) {
  const {wrapper: MDXLayout} = props.components || ({});
  return MDXLayout ? createVNode(MDXLayout, {
    ...props,
    children: createVNode(_createMdxContent, {
      ...props
    })
  }) : _createMdxContent(props);
}

const url = "src/content/blog/2025/04/2025-04-23-internet-infrastructure.mdx";
const file = "C:/Users/naser/Desktop/Safha blog/safha/src/content/blog/2025/04/2025-04-23-internet-infrastructure.mdx";
const Content = (props = {}) => MDXContent({
  ...props,
  components: { Fragment: Fragment, ...props.components, },
});
Content[Symbol.for('mdx-component')] = true;
Content[Symbol.for('astro.needsHeadRendering')] = !Boolean(frontmatter.layout);
Content.moduleId = "C:/Users/naser/Desktop/Safha blog/safha/src/content/blog/2025/04/2025-04-23-internet-infrastructure.mdx";
__astro_tag_component__(Content, 'astro:jsx');

export { Content, Content as default, file, frontmatter, getHeadings, url };
